[{"citation number": 1, "citation": "Around 3000 BC, the proto-Baltic ancestors of the Latvian people settled on the eastern coast of the Baltic Sea.[22] The Balts established trade routes to Rome and Byzantium, trading local amber for precious metals.[23] By 900 AD, four distinct Baltic tribes inhabited Latvia: Curonians, Latgalians, Selonians, Semigallians (in Latvian: kurši, latgaļi, sēļi and zemgaļi), as well as the Finnic tribe of Livonians (lībieši) speaking a Finnic language.[citation needed]"}, {"citation number": 2, "citation": "In the 17th and early 18th centuries, the Polish–Lithuanian Commonwealth, Sweden, and Russia struggled for supremacy in the eastern Baltic. After the Polish–Swedish War, northern Livonia (including Vidzeme) came under Swedish rule. Riga became the capital of Swedish Livonia and the largest city in the entire Swedish Empire.[32] Fighting continued sporadically between Sweden and Poland until the Truce of Altmark in 1629.[33][citation needed] In Latvia, the Swedish period is generally remembered as positive; serfdom was eased, a network of schools was established for the peasantry, and the power of the regional barons was diminished.[34][35]"}, {"citation number": 3, "citation": "Between the 13th and 19th centuries, Baltic Germans, many of whom were originally of non-German ancestry but had been assimilated into German culture, formed the upper class.[citation needed] They developed distinct cultural heritage, characterised by both Latvian and German influences. It has survived in German Baltic families to this day, in spite of their dispersal to Germany, the United States, Canada and other countries in the early 20th century. However, most indigenous Latvians did not participate in this particular cultural life.[citation needed] Thus, the mostly peasant local pagan heritage was preserved, partly merging with Christian traditions. For example, one of the most popular celebrations is Jāņi, a pagan celebration of the summer solstice—which Latvians celebrate on the feast day of St. John the Baptist.[citation needed]"}]